In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('carprices.csv')

In [3]:
df.head()

   Mileage  Age(yrs)  Sell Price($)
0    69000         6          18000
1    35000         3          34000
2    57000         5          26100
3    22500         2          40000
4    46000         4          31500

In [4]:
df.columns

Index(['Mileage', 'Age(yrs)', 'Sell Price($)'], dtype='object')

In [5]:
X = df[['Mileage', 'Age(yrs)']]

In [6]:
y = df[['Sell Price($)']]

In [33]:
X.head(20)

    Mileage  Age(yrs)
0     69000         6
1     35000         3
2     57000         5
3     22500         2
4     46000         4
5     59000         5
6     52000         5
7     72000         6
8     91000         8
9     67000         6
10    83000         7
11    79000         7
12    59000         5
13    58780         4
14    82450         7
15    25400         3
16    28000         2
17    69000         5
18    87600         8
19    52000         5

In [34]:
y.head(20)

    Sell Price($)
0           18000
1           34000
2           26100
3           40000
4           31500
5           26750
6           32000
7           19300
8           12000
9           22000
10          18700
11          19500
12          26000
13          27500
14          19400
15          35000
16          35500
17          19700
18          12800
19          28200

In [11]:
from sklearn.model_selection import train_test_split

In [16]:
X_train,X_test,y_train,y_test = train_test_split(X,y,train_size=0.7)

C:\Users\hp\Anaconda\envs\py35\lib\site-packages\sklearn\model_selection\_split.py:2026: FutureWarning: From version 0.21, test_size will always complement train_size unless both are specified.
  FutureWarning)

In [14]:
X_train.shape

(16, 2)

In [15]:
X_test.shape

(4, 2)

In [17]:
y_train.shape

(14, 1)

In [18]:
y_test.shape

(6, 1)

In [35]:
X_train

    Mileage  Age(yrs)
15    25400         3
13    58780         4
6     52000         5
14    82450         7
9     67000         6
16    28000         2
2     57000         5
10    83000         7
7     72000         6
3     22500         2
5     59000         5
19    52000         5
12    59000         5
11    79000         7

In [20]:
y_train

    Sell Price($)
15          35000
13          27500
6           32000
14          19400
9           22000
16          35500
2           26100
10          18700
7           19300
3           40000
5           26750
19          28200
12          26000
11          19500

In [21]:
%history

import pandas as pd
df = pd.read_csv('carprices.csv')
df.head()
df.columns
X = df[['Mileage', 'Age(yrs)']]
y = df[['Sell Price($)']]
X
X.head(10)
X.head(10)
y.head(10)
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,train_size=0.8)
X_train,X_test,y_train,y_test = train_test_split(X,y,train_size=0.8)
X_train.shape
X_test.shape
X_train,X_test,y_train,y_test = train_test_split(X,y,train_size=0.7)
y_train.shape
y_test.shape
X_train
y_train
%history

In [22]:
X_test

    Mileage  Age(yrs)
18    87600         8
17    69000         5
8     91000         8
1     35000         3
0     69000         6
4     46000         4

In [23]:
y_test

    Sell Price($)
18          12800
17          19700
8           12000
1           34000
0           18000
4           31500

In [24]:
from sklearn.linear_model import LinearRegression

In [26]:
lrm = LinearRegression()

In [29]:
lrm.fit(X_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [36]:
y_pred = lrm.predict(X_test)

In [40]:
X_test

    Mileage  Age(yrs)
18    87600         8
17    69000         5
8     91000         8
1     35000         3
0     69000         6
4     46000         4

In [38]:
y_pred

array([[16505.59854618],
       [23269.91388795],
       [15504.08705125],
       [34142.00106396],
       [22841.42777458],
       [30473.33070229]])

In [39]:
y_test

    Sell Price($)
18          12800
17          19700
8           12000
1           34000
0           18000
4           31500

In [41]:
%history

import pandas as pd
df = pd.read_csv('carprices.csv')
df.head()
df.columns
X = df[['Mileage', 'Age(yrs)']]
y = df[['Sell Price($)']]
X
X.head(10)
X.head(10)
y.head(10)
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,train_size=0.8)
X_train,X_test,y_train,y_test = train_test_split(X,y,train_size=0.8)
X_train.shape
X_test.shape
X_train,X_test,y_train,y_test = train_test_split(X,y,train_size=0.7)
y_train.shape
y_test.shape
X_train
y_train
%history
X_test
y_test
from sklearn.linear_model import LinearRegression
LinearRegression()
lrm = LinearRegression()
lrm.predict(X_train,y_trian)
lrm.predict(X_train,y_train)
lrm.fit(X_train,y_train)
lrm.predict(X_test)
y_test
X.shape
X.head(20)
y.head(20)
X_train
y_pred = lrm.predict(X_test)
Y_pred
y_pred
y_test
X_test
%history